# <u><span style="color:maroon;">*CAPSTONE  PROJECT*</span></u>

## Task 1 – <span style="color:blue">Create DataFrames and Save as CSV Files</span>

In [32]:
import pandas as pd
#Importing pandas library
import numpy as np 
#Importing numpy library

# Assign Excel file paths to separate variables
project_file = 'Project.xlsx'
employees_file = 'Employees.xlsx'
seniority_file = 'Seniority.xlsx'


# Read each Excel file into its own DataFrame
Project_df = pd.read_excel(project_file)
Employees_df = pd.read_excel(employees_file)
Seniority_df = pd.read_excel(seniority_file)

# Save each DataFrame as a CSV file
Project_df.to_csv('project.csv', index=False)
Employees_df.to_csv('employees.csv', index=False)
Seniority_df.to_csv('seniority.csv', index=False)

#  Display DataFrames

from IPython.display import display

display(Project_df)
display(Employees_df)
display(Seniority_df)

      ID     Project    Cost    Status
0   A001   Project 1 1002000  Finished
1   A002   Project 2 2000000   Ongoing
2   A003   Project 3 4500000  Finished
3   A004   Project 4 5500000   Ongoing
4   A005   Project 5     NaN  Finished
5   A002   Project 6  680000    Failed
6   A005   Project 7  400000  Finished
7   A003   Project 8  350000    Failed
8   A001   Project 9     NaN   Ongoing
9   A003  Project 10  300000  Finished
10  A001  Project 11 2000000    Failed
11  A004  Project 12 1000000   Ongoing
12  A004  Project 13 3000000  Finished
13  A005  Project 14  200000  Finished

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

## Task 2 –  <span style="color:sblue">Replace Missing Cost Values with Running Average (Using for Loop)</span>

In [33]:
#Read the CSV file 
project_df = pd.read_csv('project.csv')
# Fill missing values in 'Cost' using running average
total = 0 
count = 0 

for i in range(len(project_df)):
  # If cost value is missing (NaN)
    if pd.isnull(project_df.loc[i, 'Cost']):
        if count > 0:
            avg = total / count   # running average
            project_df.loc[i, 'Cost'] = avg  # replace NaN with running average
        else:
            project_df.loc[i, 'Cost'] = 0    # first NaN, set to 0
    else:
        # Add cost to total and increment count
        total += project_df.loc[i, 'Cost']
        count += 1

# display result 
pd.set_option('display.float_format', '{:.0f}'.format)

# save to CSV for further tasks
project_df.to_csv('project.csv', index=False)

project_df

      ID     Project    Cost    Status
0   A001   Project 1 1002000  Finished
1   A002   Project 2 2000000   Ongoing
2   A003   Project 3 4500000  Finished
3   A004   Project 4 5500000   Ongoing
4   A005   Project 5 3250500  Finished
5   A002   Project 6  680000    Failed
6   A005   Project 7  400000  Finished
7   A003   Project 8  350000    Failed
8   A001   Project 9 2061714   Ongoing
9   A003  Project 10  300000  Finished
10  A001  Project 11 2000000    Failed
11  A004  Project 12 1000000   Ongoing
12  A004  Project 13 3000000  Finished
13  A005  Project 14  200000  Finished

## Task 3 – <span style="color:blue">Split Name Column into First and Last Name</span>

In [34]:
# Read the Project data from your CSV file
Employees_df = pd.read_csv('employees.csv')

# Only do split if the 'Name' column exists
if 'Name' in Employees_df.columns:
    # Split 'Name' column into two columns: 'First Name' and 'Last Name'
    Employees_df[['First Name', 'Last Name']] = Employees_df['Name'].str.split(' ', n=1, expand=True)
    # Remove the original 'Name' column from the dataframe
    Employees_df = Employees_df.drop(columns=['Name'])
    # Save the updated dataframe to CSV for further use 
    Employees_df.to_csv('employees_updated.csv', index=False)

# To verify and display output 
Employees_df

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

## Task 4 – <span style="color:blue">Join All Three DataFrames into One Final DataFrame Named "FINAL"</span>

In [35]:
# Load the updated employee CSV with changes made 
Employees_df = pd.read_csv('employees_updated.csv')  

# Load the latest project CSV file
project_df = pd.read_csv('project.csv')  

# Load the seniority CSV file 
Seniority_df = pd.read_csv('Seniority.csv')

# Merge the project and employee dataframes on 'ID', keeping all rows from project_df
merged = pd.merge(project_df, Employees_df, on='ID', how='left')

# Merge the above result with designation dataframe on 'ID', again keeping all rows
Final = pd.merge(merged, Seniority_df, on='ID', how='left')

# Remove any rows with missing values and reset the row index for a clean result
Final = Final.dropna().reset_index(drop=True)

# To Verify and display updated merged dataframe
Final

,ID,Project,Cost,Status,Gender,City,Age,First Name,Last Name,Designation Level
0,A001,Project 1,1002000,Finished,M,Paris,25,John,Alter,2
1,A002,Project 2,2000000,Ongoing,F,London,27,Alice,Luxumberg,2
2,A003,Project 3,4500000,Finished,M,Berlin,29,Tom,Sabestine,3
3,A004,Project 4,5500000,Ongoing,F,Newyork,31,Nina,Adgra,2
4,A005,Project 5,3250500,Finished,F,Madrid,30,Amy,Johny,3
5,A002,Project 6,680000,Failed,F,London,27,Alice,Luxumberg,2
6,A005,Project 7,400000,Finished,F,Madrid,30,Amy,Johny,3
7,A003,Project 8,350000,Failed,M,Berlin,29,Tom,Sabestine,3
8,A001,Project 9,2061714,Ongoing,M,Paris,25,John,Alter,2
9,A003,Project 10,300000,Finished,M,Berlin,29,Tom,Sabestine,3
10,A001,Project 11,2000000,Failed,M,Paris,25,John,Alter,2
11,A004,Project 12,1000000,Ongoing,F,Newyork,31,Nina,Adgra,2
12,A004,Project 13,3000000,Finished,F,Newyork,31,Nina,Adgra,2
13,A005,Project 14,200000,Finished,F,Madrid,30,Amy,Johny,3

## Task 5 – <span style="color:blue">Add Bonus (5% of Cost for Finished Projects)</span>

In [36]:
# For each row in the dataframe, if the project is 'Finished', calculate Bonus as 5% of Cost, else set Bonus to 0
Final['Bonus'] = Final.apply(
    lambda row: row['Cost'] * 0.05 if str(row['Status']).lower() == 'finished' else 0,
    axis=1 )
#Mention axis and required feilds     
# Verify display the output
Final

,ID,Project,Cost,Status,Gender,City,Age,First Name,Last Name,Designation Level,Bonus
0,A001,Project 1,1002000,Finished,M,Paris,25,John,Alter,2,50100
1,A002,Project 2,2000000,Ongoing,F,London,27,Alice,Luxumberg,2,0
2,A003,Project 3,4500000,Finished,M,Berlin,29,Tom,Sabestine,3,225000
3,A004,Project 4,5500000,Ongoing,F,Newyork,31,Nina,Adgra,2,0
4,A005,Project 5,3250500,Finished,F,Madrid,30,Amy,Johny,3,162525
5,A002,Project 6,680000,Failed,F,London,27,Alice,Luxumberg,2,0
6,A005,Project 7,400000,Finished,F,Madrid,30,Amy,Johny,3,20000
7,A003,Project 8,350000,Failed,M,Berlin,29,Tom,Sabestine,3,0
8,A001,Project 9,2061714,Ongoing,M,Paris,25,John,Alter,2,0
9,A003,Project 10,300000,Finished,M,Berlin,29,Tom,Sabestine,3,15000
10,A001,Project 11,2000000,Failed,M,Paris,25,John,Alter,2,0
11,A004,Project 12,1000000,Ongoing,F,Newyork,31,Nina,Adgra,2,0
12,A004,Project 13,3000000,Finished,F,Newyork,31,Nina,Adgra,2,150000
13,A005,Project 14,200000,Finished,F,Madrid,30,Amy,Johny,3,10000

## Task 6 – <span style="color:blue">Demote Designation Level by 1 for Failed Projects, Drop If > 4</span>

In [37]:
## Decrease the 'Designation Level' by 1 for all records where the 'Status' column value is 'fail' 
Final.loc[Final['Status'].str.lower() == 'fail', 'Designation Level'] -= 1

# Filter the DataFrame to include only rows where 'Designation Level' is less than or equal to 4, 
# and reset the index to maintain a clean sequential order
# Delete records where designation level is now greater than 4
Final = Final[Final['Designation Level'] <= 4].reset_index(drop=True)

# Display the output
Final

,ID,Project,Cost,Status,Gender,City,Age,First Name,Last Name,Designation Level,Bonus
0,A001,Project 1,1002000,Finished,M,Paris,25,John,Alter,2,50100
1,A002,Project 2,2000000,Ongoing,F,London,27,Alice,Luxumberg,2,0
2,A003,Project 3,4500000,Finished,M,Berlin,29,Tom,Sabestine,3,225000
3,A004,Project 4,5500000,Ongoing,F,Newyork,31,Nina,Adgra,2,0
4,A005,Project 5,3250500,Finished,F,Madrid,30,Amy,Johny,3,162525
5,A002,Project 6,680000,Failed,F,London,27,Alice,Luxumberg,2,0
6,A005,Project 7,400000,Finished,F,Madrid,30,Amy,Johny,3,20000
7,A003,Project 8,350000,Failed,M,Berlin,29,Tom,Sabestine,3,0
8,A001,Project 9,2061714,Ongoing,M,Paris,25,John,Alter,2,0
9,A003,Project 10,300000,Finished,M,Berlin,29,Tom,Sabestine,3,15000
10,A001,Project 11,2000000,Failed,M,Paris,25,John,Alter,2,0
11,A004,Project 12,1000000,Ongoing,F,Newyork,31,Nina,Adgra,2,0
12,A004,Project 13,3000000,Finished,F,Newyork,31,Nina,Adgra,2,150000
13,A005,Project 14,200000,Finished,F,Madrid,30,Amy,Johny,3,10000

## Task 7 – <span style="color:blue"> Add Mr./Mrs. Prefix and Drop Gender Column</span>

In [38]:
# First, check if both 'Gender' and 'First Name' columns exist in the DataFrame
if 'Gender' in Final.columns and 'First Name' in Final.columns:
    # For each row, add "Mr." if gender is Male ("M"), otherwise add "Mrs." before the First Name value
    Final['First Name'] = Final.apply(
        lambda row: ('Mr. ' if str(row['Gender']).upper() == 'M' else 'Mrs. ') + str(row['First Name']),
        axis=1
    )
    # After prefixing, remove the 'Gender' column from the dataframe
    Final = Final.drop(columns=['Gender'])

# Display the Result after changes 
Final

,ID,Project,Cost,Status,City,Age,First Name,Last Name,Designation Level,Bonus
0,A001,Project 1,1002000,Finished,Paris,25,Mr. John,Alter,2,50100
1,A002,Project 2,2000000,Ongoing,London,27,Mrs. Alice,Luxumberg,2,0
2,A003,Project 3,4500000,Finished,Berlin,29,Mr. Tom,Sabestine,3,225000
3,A004,Project 4,5500000,Ongoing,Newyork,31,Mrs. Nina,Adgra,2,0
4,A005,Project 5,3250500,Finished,Madrid,30,Mrs. Amy,Johny,3,162525
5,A002,Project 6,680000,Failed,London,27,Mrs. Alice,Luxumberg,2,0
6,A005,Project 7,400000,Finished,Madrid,30,Mrs. Amy,Johny,3,20000
7,A003,Project 8,350000,Failed,Berlin,29,Mr. Tom,Sabestine,3,0
8,A001,Project 9,2061714,Ongoing,Paris,25,Mr. John,Alter,2,0
9,A003,Project 10,300000,Finished,Berlin,29,Mr. Tom,Sabestine,3,15000
10,A001,Project 11,2000000,Failed,Paris,25,Mr. John,Alter,2,0
11,A004,Project 12,1000000,Ongoing,Newyork,31,Mrs. Nina,Adgra,2,0
12,A004,Project 13,3000000,Finished,Newyork,31,Mrs. Nina,Adgra,2,150000
13,A005,Project 14,200000,Finished,Madrid,30,Mrs. Amy,Johny,3,10000

## Task 8 – <span style="color:blue">Promote Designation by 1 for Employees Over Age 29</span>

In [39]:
# Increase the 'Designation Level' by 1 for all records where the 'Age' is greater than 29 using IF condition
Final.loc[Final['Age'] > 29, 'Designation Level'] += 1 

# Display updated dataframe
Final

,ID,Project,Cost,Status,City,Age,First Name,Last Name,Designation Level,Bonus
0,A001,Project 1,1002000,Finished,Paris,25,Mr. John,Alter,2,50100
1,A002,Project 2,2000000,Ongoing,London,27,Mrs. Alice,Luxumberg,2,0
2,A003,Project 3,4500000,Finished,Berlin,29,Mr. Tom,Sabestine,3,225000
3,A004,Project 4,5500000,Ongoing,Newyork,31,Mrs. Nina,Adgra,3,0
4,A005,Project 5,3250500,Finished,Madrid,30,Mrs. Amy,Johny,4,162525
5,A002,Project 6,680000,Failed,London,27,Mrs. Alice,Luxumberg,2,0
6,A005,Project 7,400000,Finished,Madrid,30,Mrs. Amy,Johny,4,20000
7,A003,Project 8,350000,Failed,Berlin,29,Mr. Tom,Sabestine,3,0
8,A001,Project 9,2061714,Ongoing,Paris,25,Mr. John,Alter,2,0
9,A003,Project 10,300000,Finished,Berlin,29,Mr. Tom,Sabestine,3,15000
10,A001,Project 11,2000000,Failed,Paris,25,Mr. John,Alter,2,0
11,A004,Project 12,1000000,Ongoing,Newyork,31,Mrs. Nina,Adgra,3,0
12,A004,Project 13,3000000,Finished,Newyork,31,Mrs. Nina,Adgra,3,150000
13,A005,Project 14,200000,Finished,Madrid,30,Mrs. Amy,Johny,4,10000

## Task 9 – <span style="color:blue">Total Project Cost per Employee</span>

In [40]:
# To Calculate total project cost for each employee

# Group the DataFrame by 'ID' and 'First Name'
TotalProjectCost = Final.groupby(['ID', 'First Name'])['Cost'].sum().reset_index()

# Rename the 'Cost' column to 'TotalProjCost'
TotalProjectCost = TotalProjectCost.rename(columns={'Cost': 'TotalProjectCost'})

# Show  the resulting table as output
TotalProjectCost

     ID  First Name  TotalProjectCost
0  A001    Mr. John           5063714
1  A002  Mrs. Alice           2680000
2  A003     Mr. Tom           5150000
3  A004   Mrs. Nina           9500000
4  A005    Mrs. Amy           3850500

## Task 10 – <span style="color:blue">Employees Whose City Contains 'o'</span>

In [41]:
# Creating a new dataframe containing only rows where 'City' includes the letter 'o' 
filtered = Final[Final['City'].str.contains('o', case=False)]

# Display the filtered table
filtered

,ID,Project,Cost,Status,City,Age,First Name,Last Name,Designation Level,Bonus
1,A002,Project 2,2000000,Ongoing,London,27,Mrs. Alice,Luxumberg,2,0
3,A004,Project 4,5500000,Ongoing,Newyork,31,Mrs. Nina,Adgra,3,0
5,A002,Project 6,680000,Failed,London,27,Mrs. Alice,Luxumberg,2,0
11,A004,Project 12,1000000,Ongoing,Newyork,31,Mrs. Nina,Adgra,3,0
12,A004,Project 13,3000000,Finished,Newyork,31,Mrs. Nina,Adgra,3,150000